In [1]:
import pandas as pd

In [2]:
summer_df = pd.read_csv('olympic-games/summer.csv')

In [3]:
summer_df.shape

(31165, 9)

In [4]:
summer_df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [5]:
summer_df.tail()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [12]:
summer_df.loc[0:0]

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold

In [10]:
summer_df[0:3]

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze

In [14]:
summer_df.iloc[:,[0,1,3]]

       Year    City           Discipline
0      1896  Athens             Swimming
1      1896  Athens             Swimming
2      1896  Athens             Swimming
3      1896  Athens             Swimming
4      1896  Athens             Swimming
...     ...     ...                  ...
31160  2012  London  Wrestling Freestyle
31161  2012  London  Wrestling Freestyle
31162  2012  London  Wrestling Freestyle
31163  2012  London  Wrestling Freestyle
31164  2012  London  Wrestling Freestyle

[31165 rows x 3 columns]

In [6]:
# 1. Which male athlete has won most medals ?
# 2. Which female athlete has won most medals ?
# 3. Which male & female athlete has won most gold ?
# 4. Which country has won most medals ?

Gender  Medal
Men     Gold      7698
        Bronze    7539
        Silver    7509
Women   Bronze    2830
        Silver    2801
        Gold      2788
Name: Medal, dtype: int64

PHELPS, Michael         22
ANDRIANOV, Nikolay      15
MANGIAROTTI, Edoardo    13
ONO, Takashi            13
SHAKHLIN, Boris         13
Name: Athlete, dtype: int64

LATYNINA, Larisa     18
FISCHER, Birgit      12
COUGHLIN, Natalie    12
THOMPSON, Jenny      12
TORRES, Dara         12
Name: Athlete, dtype: int64

PHELPS, Michael    18
SPITZ, Mark         9
LEWIS, Carl         9
NURMI, Paavo        9
KATO, Sawao         8
Name: Athlete, dtype: int64

USA    4585
URS    2049
GBR    1720
FRA    1396
GER    1305
Name: Country, dtype: int64

In [14]:
# 1. In which year India started playing olympics ?
# 2. In which sports India has won most medals ?
# 3. Which Indian athlete has won most gold ?